RobotPatient/Manikin_Communication_Node/boards/arm/manikin_mainboard_portenta/stm32h7xx_hal_conf.h
/*
 * Copyright (c) 2024 Your Organization
 *
 * SPDX-License-Identifier: Apache-2.0
 */

 #ifndef STM32H7XX_HAL_CONF_H
 #define STM32H7XX_HAL_CONF_H
 
 #define HAL_MODULE_ENABLED
 #define HAL_CORTEX_MODULE_ENABLED
 #define HAL_RCC_MODULE_ENABLED
 #define HAL_GPIO_MODULE_ENABLED
 #define HAL_RTC_MODULE_ENABLED
 #define HAL_PWR_MODULE_ENABLED
 #define HAL_DMA_MODULE_ENABLED
 #define HAL_FDCAN_MODULE_ENABLED
 
 #include <stm32h7xx_hal_def.h>
 
 #endif /* STM32H7XX_HAL_CONF_H */